Revit 2027 API
BuiltInFailures.AnalyticalModelFailures.StructWallAnalyticalErrorAlign Property
 Can't align Analytical Model with joined Walls.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId StructWallAnalyticalErrorAlign { get; }
Public Shared ReadOnly Property StructWallAnalyticalErrorAlign As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ StructWallAnalyticalErrorAlign {
	FailureDefinitionId^ get ();
}
static member StructWallAnalyticalErrorAlign : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace